# Desafio 1

Para esse desafio, vamos trabalhar com o data set [Black Friday](https://www.kaggle.com/mehdidag/black-friday), que reúne dados sobre transações de compras em uma loja de varejo.

Vamos utilizá-lo para praticar a exploração de data sets utilizando pandas. Você pode fazer toda análise neste mesmo notebook, mas as resposta devem estar nos locais indicados.

> Obs.: Por favor, não modifique o nome das funções de resposta.

## _Set up_ da análise

In [1]:
import pandas as pd
import numpy as np

In [2]:
black_friday = pd.read_csv("black_friday.csv")

## Inicie sua análise a partir daqui

### Overview do dataset

In [3]:
# Questao 1
print("Formato do dataset: ", black_friday.shape) 
black_friday.head(5)

Formato do dataset:  (537577, 12)

,User_ID,Product_ID,Gender,Age,Occupation,City_Category,Stay_In_Current_City_Years,Marital_Status,Product_Category_1,Product_Category_2,Product_Category_3,Purchase
0,1000001,P00069042,F,0-17,10,A,2,0,3,NaN,NaN,8370
1,1000001,P00248942,F,0-17,10,A,2,0,1,6.0,14.0,15200
2,1000001,P00087842,F,0-17,10,A,2,0,12,NaN,NaN,1422
3,1000001,P00085442,F,0-17,10,A,2,0,12,14.0,NaN,1057
4,1000002,P00285442,M,55+,16,C,4+,0,8,NaN,NaN,7969

#### Quantidade de valores nulos

In [4]:
missing_data = pd.DataFrame({'Coluna': black_friday.columns,
                    'Tipo': black_friday.dtypes,
                    'Dados faltantes (%)': black_friday.isna().sum() / black_friday.shape[0]})
missing_data

,Coluna,Tipo,Dados faltantes (%)
User_ID,User_ID,int64,0.000000
Product_ID,Product_ID,object,0.000000
Gender,Gender,object,0.000000
Age,Age,object,0.000000
Occupation,Occupation,int64,0.000000
City_Category,City_Category,object,0.000000
Stay_In_Current_City_Years,Stay_In_Current_City_Years,object,0.000000
Marital_Status,Marital_Status,int64,0.000000
Product_Category_1,Product_Category_1,int64,0.000000
Product_Category_2,Product_Category_2,float64,0.310627
Product_Category_3,Product_Category_3,float64,0.694410
Purchase,Purchase,int64,0.000000

In [5]:
black_friday.describe()

,User_ID,Occupation,Marital_Status,Product_Category_1,Product_Category_2,Product_Category_3,Purchase
count,5.375770e+05,537577.00000,537577.000000,537577.000000,370591.000000,164278.000000,537577.000000
mean,1.002992e+06,8.08271,0.408797,5.295546,9.842144,12.669840,9333.859853
std,1.714393e+03,6.52412,0.491612,3.750701,5.087259,4.124341,4981.022133
min,1.000001e+06,0.00000,0.000000,1.000000,2.000000,3.000000,185.000000
25%,1.001495e+06,2.00000,0.000000,1.000000,5.000000,9.000000,5866.000000
50%,1.003031e+06,7.00000,0.000000,5.000000,9.000000,14.000000,8062.000000
75%,1.004417e+06,14.00000,1.000000,8.000000,15.000000,16.000000,12073.000000
max,1.006040e+06,20.00000,1.000000,18.000000,18.000000,18.000000,23961.000000

### Tipos de variáveis
- <b>Variáveis de identificação:</b> `User_ID`, `Product_ID`
- <b>Variáveis categóricas:</b> `Gender`, `Age`, `Occupation`, `City_Category`, `Stay_In_Current_City_Years`, `Marital_Status`,	`Product_Category_1`,	`Product_Category_2`,	`Product_Category_3`
- <b>Variável numérica:</b> `Purchase`

#### Valores existentes para cada variável categórica:

In [6]:
categorical_features = black_friday.loc[0, 'Gender':'Product_Category_3'].index

for i in categorical_features:
    print("\nTipos de categoria da variável " + i)
    print(black_friday[i].value_counts())

Tipos de categoria da variável Gender
M    405380
F    132197
Name: Gender, dtype: int64

Tipos de categoria da variável Age
26-35    214690
36-45    107499
18-25     97634
46-50     44526
51-55     37618
55+       20903
0-17      14707
Name: Age, dtype: int64

Tipos de categoria da variável Occupation
4     70862
0     68120
7     57806
1     45971
17    39090
20    32910
12    30423
14    26712
2     25845
16    24790
6     19822
3     17366
10    12623
5     11985
15    11812
11    11338
19     8352
13     7548
18     6525
9      6153
8      1524
Name: Occupation, dtype: int64

Tipos de categoria da variável City_Category
B    226493
C    166446
A    144638
Name: City_Category, dtype: int64

Tipos de categoria da variável Stay_In_Current_City_Years
1     189192
2      99459
3      93312
4+     82889
0      72725
Name: Stay_In_Current_City_Years, dtype: int64

Tipos de categoria da variável Marital_Status
0    317817
1    219760
Name: Marital_Status, dtype: int64

Tipos de categoria da variável Product_Category_1
5     148592
1     138353
8     112132
11     23960
2      23499
6      20164
3      19849
4      11567
16      9697
15      6203
13      5440
10      5032
12      3875
7       3668
18      3075
14      1500
17       567
9        404
Name: Product_Category_1, dtype: int64

Tipos de categoria da variável Product_Category_2
8.0     63058
14.0    54158
2.0     48481
16.0    42602
15.0    37317
5.0     25874
4.0     25225
6.0     16251
11.0    13945
17.0    13130
13.0    10369
9.0      5591
12.0     5419
10.0     2991
3.0      2835
18.0     2730
7.0       615
Name: Product_Category_2, dtype: int64

Tipos de categoria da variável Product_Category_3
16.0    32148
15.0    27611
14.0    18121
17.0    16449
5.0     16380
8.0     12384
9.0     11414
12.0     9094
13.0     5385
6.0      4818
18.0     4563
4.0      1840
11.0     1773
10.0     1698
3.0       600
Name: Product_Category_3, dtype: int64

## Questão 1

Quantas observações e quantas colunas há no dataset? Responda no formato de uma tuple `(n_observacoes, n_colunas)`.

In [7]:
def q1():
    return black_friday.shape
    pass

## Questão 2

Há quantas mulheres com idade entre 26 e 35 anos no dataset? Responda como um único escalar.

In [8]:
def q2():
    woman_26_to_35 = black_friday.query("Gender == 'F' & Age == '26-35'")
    return len(woman_26_to_35)
    pass

# Caso deseje contabilizar a quantidade de mulheres unicas de 26 a 25
#woman_26_to_35 = black_friday.query("Gender == 'F' & Age == '26-35'")
#woman_26_to_35 = woman_26_to_35.loc[:,['User_ID', 'Gender']].drop_duplicates()
#len(woman_26_to_35)

## Questão 3

Quantos usuários únicos há no dataset? Responda como um único escalar.

In [9]:
def q3():
    unique_id = black_friday['User_ID'].unique()
    return len(unique_id)
    pass

## Questão 4

Quantos tipos de dados diferentes existem no dataset? Responda como um único escalar.

In [10]:
def q4():
    type_of_data = list()
    for i in black_friday.columns:
        type_of_data.append(black_friday[i].dtype)
    
    return len(set(type_of_data))
    pass

## Questão 5

Qual porcentagem dos registros possui ao menos um valor null (`None`, `ǸaN` etc)? Responda como um único escalar entre 0 e 1.

In [11]:
def q5():  
    list_missing_data = black_friday.isna().sum()
    percentual_missing = max(list_missing_data) / black_friday.shape[0]
    
    return percentual_missing
    pass

## Questão 6

Quantos valores null existem na variável (coluna) com o maior número de null? Responda como um único escalar.

In [12]:
def q6():
    list_missing_data = black_friday.isna().sum()
    return max(list_missing_data)
    pass

## Questão 7

Qual o valor mais frequente (sem contar nulls) em `Product_Category_3`? Responda como um único escalar.

In [13]:
def q7():
    return black_friday['Product_Category_3'].mode()[0]
    pass

## Questão 8

Qual a nova média da variável (coluna) `Purchase` após sua normalização? Responda como um único escalar.

In [14]:
def q8():
    min_column = black_friday['Purchase'].min()
    max_column = black_friday['Purchase'].max()
    purchased_data = black_friday['Purchase']

    normalized_purchased = ((purchased_data - min_column) / (max_column - min_column))
    return normalized_purchased.mean()
    pass

## Questão 9

Quantas ocorrências entre -1 e 1 inclusive existem da variáel `Purchase` após sua padronização? Responda como um único escalar.

In [35]:
def q9():
    min_column = black_friday['Purchase'].min()
    max_column = black_friday['Purchase'].max()
    purchased_data = black_friday['Purchase']

    normalized_purchased = ((purchased_data - min_column) / (max_column - min_column))

    # This normalization uses the mean and standard deviation 
    normalized_purchased_2 = (normalized_purchased - normalized_purchased.mean()) / np.std(normalized_purchased)

    normalized_purchased_2 = pd.DataFrame(normalized_purchased_2)
    normalized_purchased_2 = ((normalized_purchased_2 <= 1) & (normalized_purchased_2 >= -1))
    return normalized_purchased_2['Purchase'].value_counts()[1]
    pass

## Questão 10

Podemos afirmar que se uma observação é null em `Product_Category_2` ela também o é em `Product_Category_3`? Responda com um bool (`True`, `False`).

In [16]:
def q10():
    product_c2_null_c3_not_null = black_friday.query("Product_Category_2 == 'NaN' & Product_Category_3 != 'NaN'")
    if(len(product_c2_null_c3_not_null) == 0):
        return True
    else:
        return False
    pass